Revit 2027 API
FlexPipe.EndTangent Property
 Gets or sets the tangent vector at the end of the curve. The invalid or zero vector is ignored when setting the tangent.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ EndTangent { get; set; }
Public Property EndTangent As XYZ
	Get
	Set
public:
property XYZ^ EndTangent {
	XYZ^ get ();
	void set (XYZ^ value);
}
member EndTangent : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
FlexPipe Class
Autodesk.Revit.DB.Plumbing Namespace